#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=94ddcb56-a00d-4085-a522-4ade1a6c439c]
module.keycloak_prod.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=79c4664d-82a0-4406-8b67-80a9d42b3b89]
module.keycloak_prod.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b17d0706-85d8-48a7-9fb9-1a40e2859a04]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e68683c1-2c8d-42c2-be14-f5d15204efb8]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0fe9e1ce-b106-4b12-ba6c-284f60baf198]
module.keycloak_prod.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7f29356e-1f2a-4801-bf79-997ea6f6771d]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=840c3579-34b1-4539-bb0b-5c72a2371696]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2c0c29e8-f470-4836-85e1-b8269d4a7001]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=76da18c1-698a-4cac-98d1-f96e42fea05f]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e03d4f9c-f63a-42d7-8625-4bf4dddca852]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ac89b75f-42c1-43e8-b0e8-0ebe808ad914]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f2e2fff6-9d38-405c-a63b-ce0dda1ff458]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=351edd81-822c-4891-aef9-2a77aaf52f94]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=dd19786b-6e93-4234-ad04-da2d994bf7c9]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=652cb0a5-514b-4ed4-9455-7b4fe53d695c]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=9e66abb4-b63a-4501-afad-756dd34cde3c]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7be05a4d-094f-469a-ac5c-49337733d4af]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c1eb19d9-89b2-4fc0-ae40-6d012c908837]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a200029a-e80b-49f8-a7fa-6082ad3fe89c]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c41ccebc-f2d0-414b-950b-c59c802b6a75]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cf417984-89d6-4b04-8657-cf1ceaaa78c6]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=76a2a376-381b-440b-93c3-68ebcdd0bf71]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f24ddbf9-6e0b-42f4-8289-bf84c1e1a2db]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=af38e95a-b7a3-4b5a-b35a-fd9d20ee5cbc]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a59326b0-9732-4b5b-8b02-60ff96c52cbd]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6e0b83e9-4be3-42da-ba3e-2946bf138126]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5ab6e548-9bbd-4ea7-bd04-c6a47bc2de67]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=65874df5-8751-49f2-abc2-e261d86f6cb5]
module.keycloak_prod.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8010b3ec-b584-4825-8982-cf1241745500]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=be856ddc-ed4a-4595-8434-a49efacde8e4]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c40ba8ac-cbab-4622-a68b-d3273a454ec2]
module.keycloak_prod.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e16e4817-4390-440a-be44-8aae554c14df]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8ae279b7-44a4-4cc6-bc29-da303eb14ff3]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0c24fe36-cf7d-4789-bec8-484065f5265e]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f79b9d8b-0ddb-4773-b0d7-eea40f3e9fd7]
module.keycloak_prod.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=52e52c1c-f09d-4bb4-925f-d2ee657ee25c]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d83711fc-4898-431a-abef-f42bdafae807]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ae386d64-784a-4a8b-ba94-6941129e3ad3]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5f82c756-9443-48a7-9501-cb6eb0eb2ac3]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=dc0e2750-aad7-4a56-af72-ec14d64b9835]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c4b405e-48c4-424e-ad46-c05ddf8187c6]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ccebffe8-4187-478b-92ae-2632a8966fb9]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=accb4620-9139-4614-adcf-c6cee0a5cee6]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=34fe8125-8207-4620-b672-6349c58fce3f]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8b40abb6-fe38-4299-b604-f02fadc6494d]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=819adc6e-8790-440a-b3fa-650bd4d9eed6]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=426501a3-8eff-48bc-8216-6000ef9ad84c]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f1b7c9a8-8e62-4037-bce5-9cdaede715eb]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fa9c42ef-c731-490e-8cdb-15dcf00d6565]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=49d7d572-0cbf-43b6-9037-2c649bd5f6b7]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=557ba65a-8d4a-45c0-a380-16b32950f7ba]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=847f67e1-c8ac-4881-9ade-703fb4c582c6]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=615b359d-d806-4edd-b520-c46063c003b8]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d6141814-40e2-479c-a691-d64d7802ddf8]
module.keycloak_prod.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f6ee2c9f-e9b5-49ab-9466-7f5a3a47510c]
module.keycloak_prod.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b6f55f5b-0e9c-4410-bfaa-6dadead17725]
module.keycloak_prod.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a791425d-7601-4b31-8227-a02b55bb3946]
module.keycloak_prod.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=37b4f850-da85-4dcc-8511-3d75cd882966]
module.keycloak_prod.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b172ac2f-36a9-4c89-9559-e1998b9a8f4f]
module.keycloak_prod.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=be7cec45-65bf-4213-a6b4-c459a28a0736]
module.keycloak_prod.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=88319d4b-2bf5-4d87-864a-5bf056bc69e9]
module.keycloak_prod.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=54edb85c-5c58-4c6e-bfea-0f56bbf506f8]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=864fd373-352b-46f0-be77-cb523b2d5bb1]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=343e1549-fbc8-4272-a082-874cdff61137]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a961018f-0b8f-4b86-bf8d-e81e189c3818]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=44f9174b-ac39-4ac7-9424-da7d29848674]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f842a279-bbd9-4702-a80e-829dde93795f]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=6cf1ad14-ce67-4c7f-9c36-eeb746914069]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=251a9047-4924-4a03-8108-b738b841b93e]
module.keycloak_prod.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=37224ec3-26a4-4aae-affa-7464fe37be6c]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=583ff0c9-2c2e-4ab8-bd30-0478b5bfda23]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=362d976c-2820-4f0f-a373-c520c3478342]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=583832ff-31c6-44cc-ac45-92a613fbf55b]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=80124ac5-0cfb-4bdc-bb8c-bb064be97d64]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6a7af59a-11e1-428c-b95b-a003240adc81]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c7c13561-3d76-4df9-8cde-4818654a47fa]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2ba29669-a2be-43c4-9e73-13c9b066ff39]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bcee6b9e-fc99-436e-943e-69858a9502cd]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=882853bb-bf48-4698-b2bb-103fda3748ec]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9425db28-1d87-4f78-bb8d-e130fd212637]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1857a679-9e33-4fc9-8900-3e1637d5fee8]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cdef4b98-07dd-454e-bd35-716c44053717]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=04f15480-a480-4521-9ee4-b6b45e300d29]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5b0ebc11-0c14-431f-b4eb-58dcba0fbcfe]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7f44ef42-a9d1-409c-9ce0-168d680956ca]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4d0086b5-0c2d-43fc-9dc3-3df68f97dced]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8f53305-a0bd-4217-8f99-f01f7ac449e9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cd8fc724-320f-454f-b84a-b80913bca910]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d76c8e8-1cc6-4ba3-8bc1-f10b2a0ddcb1]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e12b99a3-70bb-45cc-934a-353bbe2a2621]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c05ff3c3-9d3c-4f63-9749-734267a00def]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=376b14e1-332d-473f-87d2-6840780376e6]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=45578e11-c4be-4421-b4bf-1d0d52198a0d]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e667cf59-6571-4ade-801b-e982726167b8]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "3b8a90dc-f5bd-4a7f-a5cb-56a881a685ba"
        name                                     = "feb-2-test-team-access-to-json-4918"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "feb-3-test-team-access-to-files-4951"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "feb-3-test-team-access-to-files-4951"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.test.ca",
        ]
      + web_origins                              = [
          + "+",
          + "http://www.test.ca",
        ]
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "testprojectjunmin-3367"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "testprojectjunmin-3367"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "testprojectjunmin-3367"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "testprojectjunmin-3367"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3456 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*